package com.runner.testworks.controller.yuyao;

import com.alibaba.fastjson2.JSONObject;
import org.springframework.web.bind.annotation.GetMapping;
import org.springframework.web.bind.annotation.RequestParam;
import org.springframework.web.bind.annotation.RestController;

import javax.servlet.http.HttpServletRequest;

/**
 * @author weizhenqiang
 * @date 2024/8/13 10:36
 */

@RestController
public class YuYaoController {


    /**
     * 流量统计折线图
     * @param time
     * @return
     */
    @GetMapping("/openapi/analyse/netflow/list")
    public JSONObject list(@RequestParam("time") String time) {


//        String json = "\n" +
//                " {\n" +
//                "    \"data\": [\n" +
//                "        {\n" +
//                "            \"data\": [\n" +
//                "                {\n" +
//                "                    \"xAxis\": \"14:52:44\",\n" +
//                "                    \"xxAxis\": \"2022-05-10 14:52:44\",\n" +
//                "                    \"yAxis\": \"100\"\n" +
//                "                },\n" +
//                "                {\n" +
//                "                    \"xAxis\": \"14:57:44\",\n" +
//                "                    \"xxAxis\": \"2022-05-10 14:57:44\",\n" +
//                "                    \"yAxis\": \"120\"\n" +
//                "                },\n" +
//                "                {\n" +
//                "                    \"xAxis\": \"15:02:44\",\n" +
//                "                    \"xxAxis\": \"2022-05-10 15:02:44\",\n" +
//                "                    \"yAxis\": \"4410\"\n" +
//                "                },\n" +
//                "                {\n" +
//                "                    \"xAxis\": \"15:07:44\",\n" +
//                "                    \"xxAxis\": \"2022-05-10 15:07:44\",\n" +
//                "                    \"yAxis\": \"10\"\n" +
//                "                },\n" +
//                "                {\n" +
//                "                    \"xAxis\": \"15:12:44\",\n" +
//                "                    \"xxAxis\": \"2022-05-10 15:12:44\",\n" +
//                "                    \"yAxis\": \"40\"\n" +
//                "                },\n" +
//                "                {\n" +
//                "                    \"xAxis\": \"15:17:44\",\n" +
//                "                    \"xxAxis\": \"2022-05-10 15:17:44\",\n" +
//                "                    \"yAxis\": \"110\"\n" +
//                "                },\n" +
//                "                {\n" +
//                "                    \"xAxis\": \"15:22:44\",\n" +
//                "                    \"xxAxis\": \"2022-05-10 15:22:44\",\n" +
//                "                    \"yAxis\": \"12340\"\n" +
//                "                },\n" +
//                "                {\n" +
//                "                    \"xAxis\": \"15:27:44\",\n" +
//                "                    \"xxAxis\": \"2022-05-10 15:27:44\",\n" +
//                "                    \"yAxis\": \"12340\"\n" +
//                "                },\n" +
//                "                {\n" +
//                "                    \"xAxis\": \"15:32:44\",\n" +
//                "                    \"xxAxis\": \"2022-05-10 15:32:44\",\n" +
//                "                    \"yAxis\": \"0\"\n" +
//                "                },\n" +
//                "                {\n" +
//                "                    \"xAxis\": \"15:37:44\",\n" +
//                "                    \"xxAxis\": \"2022-05-10 15:37:44\",\n" +
//                "                    \"yAxis\": \"43210\"\n" +
//                "                },\n" +
//                "                {\n" +
//                "                    \"xAxis\": \"15:42:44\",\n" +
//                "                    \"xxAxis\": \"2022-05-10 15:42:44\",\n" +
//                "                    \"yAxis\": \"120\"\n" +
//                "                },\n" +
//                "                {\n" +
//                "                    \"xAxis\": \"15:47:44\",\n" +
//                "                    \"xxAxis\": \"2022-05-10 15:47:44\",\n" +
//                "                    \"yAxis\": \"430\"\n" +
//                "                },\n" +
//                "                {\n" +
//                "                    \"xAxis\": \"15:52:44\",\n" +
//                "                    \"xxAxis\": \"2022-05-10 15:52:44\",\n" +
//                "                    \"yAxis\": \"1110\"\n" +
//                "                }\n" +
//                "            ],\n" +
//                "            \"poid\": 0\n" +
//                "        },\n" +
//
//                "        {\n" +
//                "            \"data\": [\n" +
//                "                {\n" +
//                "                    \"xAxis\": \"14:52:44\",\n" +
//                "                    \"xxAxis\": \"2022-05-10 14:52:44\",\n" +
//                "                    \"yAxis\": \"320\"\n" +
//                "                },\n" +
//                "                {\n" +
//                "                    \"xAxis\": \"14:57:44\",\n" +
//                "                    \"xxAxis\": \"2022-05-10 14:57:44\",\n" +
//                "                    \"yAxis\": \"450\"\n" +
//                "                },\n" +
//                "                {\n" +
//                "                    \"xAxis\": \"15:02:44\",\n" +
//                "                    \"xxAxis\": \"2022-05-10 15:02:44\",\n" +
//                "                    \"yAxis\": \"7650\"\n" +
//                "                },\n" +
//                "                {\n" +
//                "                    \"xAxis\": \"15:07:44\",\n" +
//                "                    \"xxAxis\": \"2022-05-10 15:07:44\",\n" +
//                "                    \"yAxis\": \"440\"\n" +
//                "                },\n" +
//                "                {\n" +
//                "                    \"xAxis\": \"15:12:44\",\n" +
//                "                    \"xxAxis\": \"2022-05-10 15:12:44\",\n" +
//                "                    \"yAxis\": \"760\"\n" +
//                "                },\n" +
//                "                {\n" +
//                "                    \"xAxis\": \"15:17:44\",\n" +
//                "                    \"xxAxis\": \"2022-05-10 15:17:44\",\n" +
//                "                    \"yAxis\": \"440\"\n" +
//                "                },\n" +
//                "                {\n" +
//                "                    \"xAxis\": \"15:22:44\",\n" +
//                "                    \"xxAxis\": \"2022-05-10 15:22:44\",\n" +
//                "                    \"yAxis\": \"760\"\n" +
//                "                },\n" +
//                "                {\n" +
//                "                    \"xAxis\": \"15:27:44\",\n" +
//                "                    \"xxAxis\": \"2022-05-10 15:27:44\",\n" +
//                "                    \"yAxis\": \"440\"\n" +
//                "                },\n" +
//                "                {\n" +
//                "                    \"xAxis\": \"15:32:44\",\n" +
//                "                    \"xxAxis\": \"2022-05-10 15:32:44\",\n" +
//                "                    \"yAxis\": \"7650\"\n" +
//                "                },\n" +
//                "                {\n" +
//                "                    \"xAxis\": \"15:37:44\",\n" +
//                "                    \"xxAxis\": \"2022-05-10 15:37:44\",\n" +
//                "                    \"yAxis\": \"45670\"\n" +
//                "                },\n" +
//                "                {\n" +
//                "                    \"xAxis\": \"15:42:44\",\n" +
//                "                    \"xxAxis\": \"2022-05-10 15:42:44\",\n" +
//                "                    \"yAxis\": \"7650\"\n" +
//                "                },\n" +
//                "                {\n" +
//                "                    \"xAxis\": \"15:47:44\",\n" +
//                "                    \"xxAxis\": \"2022-05-10 15:47:44\",\n" +
//                "                    \"yAxis\": \"45670\"\n" +
//                "                },\n" +
//                "                {\n" +
//                "                    \"xAxis\": \"15:52:44\",\n" +
//                "                    \"xxAxis\": \"2022-05-10 15:52:44\",\n" +
//                "                    \"yAxis\": \"770\"\n" +
//                "                }\n" +
//                "            ],\n" +
//                "            \"poid\": 1\n" +
//                "        }\n" +
//                "    ],\n" +
//                "    \"error_code\": 200,\n" +
//                "    \"message\": \"成功\"\n" +
//                " }\n";

        String json="nalyse/netflow/list";

        return JSONObject.parseObject(json);
    }


    /**
     * 异常客户端ip--->异常客户端IP-TOP30
     *
     * @param begin
     * @param end
     * @return
     */
    @GetMapping("/openapi/analyse/safe-event/sip/top30")
    public JSONObject sipTop30(HttpServletRequest request,@RequestParam("begin") String begin, @RequestParam("end") String end) {

        String header = request.getHeader("apikey");
        System.out.println("begin:"+begin+",end:"+end);

        String json = "\n" +
                "{\n" +
                " \"error_code\": 200,\n" +
                " \"message\": \"成功\",\n" +
                " \"data\": [\n" +
                "         {\n" +
                "         \"id\": 1,\n" +
                "         \"name\": \"10.20.152.34\",\n" +
                "         \"value\": 4\n" +
                "         },\n" +
                "         { \n" +
                "            \"id\": 2,\n" +
                "            \"name\": \"10.1.0.149\",\n" +
                "            \"value\": 3\n" +
                "        },\n" +
//                "        {\n" +
//                "            \"id\": 3,\n" +
//                "            \"name\": \"94.23.64.0\",\n" +
//                "            \"value\": 3\n" +
//                "        },\n" +
//                "        {\n" +
//                "            \"id\": 4,\n" +
//                "            \"name\": \"116.211.165.14\",\n" +
//                "            \"value\": 3\n" +
//                "        },\n" +
//                "        {\n" +
//                "            \"id\": 5,\n" +
//                "            \"name\": \"103.40.163.95\",\n" +
//                "            \"value\": 3\n" +
//                "        },\n" +
//                "        {\n" +
//                "            \"id\": 6,\n" +
//                "            \"name\": \"192.168.10.230\",\n" +
//                "            \"value\": 3\n" +
//                "        },\n" +
//                "        {\n" +
//                "            \"id\": 7,\n" +
//                "            \"name\": \"10.1.1.129\",\n" +
//                "            \"value\": 3\n" +
//                "        },\n" +
//                "        {\n" +
//                "            \"id\": 8,\n" +
//                "            \"name\": \"fe80::20c:29ff:c0a8:ae6\",\n" +
//                "            \"value\": 3\n" +
//                "        },\n" +
//                "        {\n" +
//                "            \"id\": 9,\n" +
//                "            \"name\": \"192.168.33.75\",\n" +
//                "            \"value\": 3\n" +
//                "        },\n" +
//                "        {\n" +
//                "            \"id\": 10,\n" +
//                "            \"name\": \"2002:1:2:3:3::2248\",\n" +
//                "            \"value\": 2\n" +
//                "        },\n" +
//                "        {\n" +
//                "            \"id\": 11,\n" +
//                "            \"name\": \"192.168.10.102\",\n" +
//                "            \"value\": 2\n" +
//                "        },\n" +
//                "        {\n" +
//                "            \"id\": 12,\n" +
//                "            \"name\": \"192.168.1.2\",\n" +
//                "            \"value\": 2\n" +
//                "        },\n" +
//                "        {\n" +
//                "            \"id\": 13,\n" +
//                "            \"name\": \"2002:1:2:3:3::e8e2\",\n" +
//                "            \"value\": 2\n" +
//                "        },\n" +
//                "        {\n" +
//                "            \"id\": 14,\n" +
//                "            \"name\": \"192.168.30.13\",\n" +
//                "            \"value\": 2\n" +
//                "        },\n" +
//                "        {\n" +
//                "            \"id\": 15,\n" +
//                "            \"name\": \"192.168.66.214\",\n" +
//                "            \"value\": 2\n" +
//                "        },\n" +
//                "        {\n" +
//                "            \"id\": 16,\n" +
//                "            \"name\": \"192.168.7.39\",\n" +
//                "            \"value\": 2\n" +
//                "        },\n" +
//                "        {\n" +
//                "            \"id\": 17,\n" +
//                "            \"name\": \"2002:1:2:3:3::1e0b\",\n" +
//                "            \"value\": 2\n" +
//                "        },\n" +
//                "        {\n" +
//                "            \"id\": 18,\n" +
//                "            \"name\": \"fe80::20c:29ff:c0a8:1e49\",\n" +
//                "            \"value\": 2\n" +
//                "        },\n" +
//                "        {\n" +
//                "            \"id\": 19,\n" +
//                "            \"name\": \"10.1.5.110\",\n" +
//                "            \"value\": 2\n" +
//                "        },\n" +
//                "        {\n" +
//                "            \"id\": 20,\n" +
//                "            \"name\": \"192.168.10.22\",\n" +
//                "            \"value\": 2\n" +
//                "        },\n" +
//                "        {\n" +
//                "            \"id\": 21,\n" +
//                "            \"name\": \"211.155.233.88\",\n" +
//                "            \"value\": 2\n" +
//                "        },\n" +
//                "        {\n" +
//                "            \"id\": 22,\n" +
//                "            \"name\": \"2002:1:2:3:3::d751\",\n" +
//                "            \"value\": 2\n" +
//                "        },\n" +
//                "        {\n" +
//                "            \"id\": 23,\n" +
//                "            \"name\": \"2002:1:2:3:3::f9ae\",\n" +
//                "            \"value\": 2\n" +
//                "        },\n" +
                "        {\n" +
                "            \"id\": 24,\n" +
                "            \"name\": \"192.168.14.60\",\n" +
                "            \"value\": 211\n" +
                "        }\n" +
                "    ]\n" +
                " }\n";

        return JSONObject.parseObject(json);
    }


    /**
     * 攻击类型排行--->安全事件发生次数
     *
     * @param begin
     * @param end
     * @return
     */
    @GetMapping("/openapi/analyse/safe-event/event/top")
    public JSONObject eventTop(HttpServletRequest request, @RequestParam("begin") String begin, @RequestParam("end") String end) {


        System.out.println("begin:"+begin+",end:"+end);

        String json = "{\n" +
                "    \"error_code\": 200,\n" +
                "    \"message\": \"成功\",\n" +
                "    \"data\": [\n" +
                "        {\n" +
                "            \"id\": 44,\n" +
                "            \"name\": \"邮件社工类事件\",\n" +
                "            \"value\": 1050\n" +
                "        },\n" +
                "        {\n" +
                "            \"id\": 33,\n" +
                "            \"name\": \"Webshell后门访问事件\",\n" +
                "            \"value\": 488\n" +
                "        },\n" +
                "        {\n" +
                "            \"id\": 18,\n" +
                "            \"name\": \"漏洞攻击事件\",\n" +
                "            \"value\": 427\n" +
                "        },\n" +
                "        {\n" +
                "            \"id\": 32,\n" +
                "            \"name\": \"Webshell文件探测事件\",\n" +
                "            \"value\": 401\n" +
                "        },\n" +
                "        {\n" +
                "            \"id\": 4,\n" +
                "            \"name\": \"代码执行攻击事件\",\n" +
                "            \"value\": 357\n" +
                "        },\n" +
                "        {\n" +
                "            \"id\": 36,\n" +
                "            \"name\": \"弱口令登录事件\",\n" +
                "            \"value\": 304\n" +
                "        },\n" +
                "        {\n" +
                "            \"id\": 1,\n" +
                "            \"name\": \"SQL注入攻击事件\",\n" +
                "            \"value\": 220\n" +
                "        },\n" +
                "        {\n" +
                "            \"id\": 31,\n" +
                "            \"name\": \"远程控制事件\",\n" +
                "            \"value\": 204\n" +
                "        },\n" +
                "        {\n" +
                "            \"id\": 2,\n" +
                "            \"name\": \"命令注入攻击事件\",\n" +
                "            \"value\": 201\n" +
                "        },\n" +
                "        {\n" +
                "            \"id\": 37,\n" +
                "            \"name\": \"拒绝服务攻击事件\",\n" +
                "            \"value\": 181\n" +
                "        },\n" +
                "        {\n" +
                "            \"id\": 3,\n" +
                "            \"name\": \"跨站脚本攻击事件\",\n" +
                "            \"value\": 161\n" +
                "        },\n" +
                "        {\n" +
                "            \"id\": 26,\n" +
                "            \"name\": \"挖矿木马事件\",\n" +
                "            \"value\": 147\n" +
                "        },\n" +
                "        {\n" +
                "            \"id\": 41,\n" +
                "            \"name\": \"隐蔽通信事件\",\n" +
                "            \"value\": 141\n" +
                "        },\n" +
                "        {\n" +
                "            \"id\": 10,\n" +
                "            \"name\": \"信息泄露事件\",\n" +
                "            \"value\": 133\n" +
                "        },\n" +
                "        {\n" +
                "            \"id\": 16,\n" +
                "            \"name\": \"特洛伊木马事件\",\n" +
                "            \"value\": 117\n" +
                "        },\n" +
                "        {\n" +
                "            \"id\": 47,\n" +
                "            \"name\": \"行为异常事件\",\n" +
                "            \"value\": 98\n" +
                "        },\n" +
                "        {\n" +
                "            \"id\": 47,\n" +
                "            \"name\": \"行为异常事件\",\n" +
                "            \"value\": 98\n" +
                "        },\n" +
                "        {\n" +
                "            \"id\": 47,\n" +
                "            \"name\": \"行为异常事件\",\n" +
                "            \"value\": 98\n" +
                "        },\n" +
                "        {\n" +
                "            \"id\": 47,\n" +
                "            \"name\": \"行为异常事件\",\n" +
                "            \"value\": 98\n" +
                "        },\n" +
                "        {\n" +
                "            \"id\": 47,\n" +
                "            \"name\": \"行为异常事件\",\n" +
                "            \"value\": 98\n" +
                "        },\n" +
                "        {\n" +
                "            \"id\": 47,\n" +
                "            \"name\": \"行为异常事件\",\n" +
                "            \"value\": 98\n" +
                "        },\n" +
                "        {\n" +
                "            \"id\": 9,\n" +
                "            \"name\": \"路径遍历事件\",\n" +
                "            \"value\": 97111\n" +
                "        }\n" +
                "    ]\n" +
                " }";

        return JSONObject.parseObject(json);
    }

}
